Repository: CofficLab/Cisum_SwiftUI
Catalog: Packages/MagicPlayMan/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk, zh_hant_tw

source: Artist parameter is nil
zh_hans: artist 参数为 nil
zh_hant_hk: artist 參數為 nil
zh_hant_tw: artist 引數為 nil

source: Basic
zh_hans: 基本
zh_hant_hk: 基本
zh_hant_tw: 基本

source: Basic Usage
zh_hans: 基本用法
zh_hant_hk: 基本用法
zh_hant_tw: 基本用法

source: Basic Usage (Non-Verbose)
zh_hans: 基本用法（非详细）
zh_hant_hk: 基本用法（非詳細）
zh_hant_tw: 基本用法（非詳細）

source: Basic Usage (Verbose)
zh_hans: 基本用法（详细）
zh_hant_hk: 基本用法（詳細）
zh_hant_tw: 基本用法（詳細）

source: Buffering...
zh_hans: 缓冲中...
zh_hant_hk: 緩衝中...
zh_hant_tw: 緩衝中...

source: Cancel
zh_hans: 取消
zh_hant_hk: 取消
zh_hant_tw: 取消

source: Check if the URL format is correct
zh_hans: 请检查 URL 格式是否正确
zh_hant_hk: 請檢查 URL 格式是否正確
zh_hant_tw: 請檢查 URL 格式是否正確

source: Check your internet connection and try again
zh_hans: 请检查网络连接后重试
zh_hant_hk: 請檢查網絡連接後重試
zh_hant_tw: 請檢查網路連線後重試

source: Choose a supported audio or video format
zh_hans: 请选择支持的音频或视频格式
zh_hant_hk: 請選擇支持的音頻或視頻格式
zh_hant_tw: 請選擇支援的音訊或影片格式

source: Close Media Library
zh_hans: 关闭媒体库
zh_hant_hk: 關閉媒體庫
zh_hant_tw: 關閉媒體庫

source: Connecting...
zh_hans: 连接中...
zh_hant_hk: 連接中...
zh_hant_tw: 連線中...

source: Dark Mode
zh_hans: 深色模式
zh_hant_hk: 深色模式
zh_hant_tw: 深色模式

source: Default Cover
zh_hans: 默认封面
zh_hant_hk: 默認封面
zh_hant_tw: 預設封面

source: Default Cover Image
zh_hans: 默认封面图
zh_hant_hk: 默認封面圖
zh_hant_tw: 預設封面圖

source: Different Sizes
zh_hans: 不同尺寸
zh_hant_hk: 不同尺寸
zh_hant_tw: 不同尺寸

source: Downloading
zh_hans: 正在下载
zh_hant_hk: 正在下載
zh_hant_tw: 正在下載

source: Empty State
zh_hans: 空状态
zh_hant_hk: 空狀態
zh_hant_tw: 空狀態

source: Error
zh_hans: 错误
zh_hant_hk: 錯誤
zh_hant_tw: 錯誤

source: Error State (No Default Cover)
zh_hans: 错误状态（无默认封面）
zh_hant_hk: 錯誤狀態（無默認封面）
zh_hant_tw: 錯誤狀態（無預設封面）

source: Error State (With Default Cover)
zh_hans: 错误状态（有默认封面）
zh_hant_hk: 錯誤狀態（有默認封面）
zh_hant_tw: 錯誤狀態（有預設封面）

source: Event Subscribers
zh_hans: 事件订阅者
zh_hant_hk: 事件訂閲者
zh_hant_tw: 事件訂閱者

source: External Artwork
zh_hans: 外部传入 Artwork
zh_hant_hk: 外部傳入 Artwork
zh_hant_tw: 外部傳入 Artwork

source: External Cover
zh_hans: 外部封面
zh_hant_hk: 外部封面
zh_hant_tw: 外部封面

source: External cover has highest priority, default cover as fallback
zh_hans: 外部封面优先级最高，默认封面作为后备
zh_hant_hk: 外部封面優先級最高，默認封面作為後備
zh_hant_tw: 外部封面優先順序最高，預設封面作為後備

source: Failed
zh_hans: 失败
zh_hant_hk: 失敗
zh_hant_tw: 失敗

source: Failed to load artwork
zh_hans: 加载封面失败
zh_hant_hk: 加載封面失敗
zh_hant_tw: 載入封面失敗

source: Failed to Load Media
zh_hans: 加载媒体失败
zh_hant_hk: 加載媒體失敗
zh_hant_tw: 載入媒體失敗

source: Fallback
zh_hans: 后备方案
zh_hant_hk: 後備方案
zh_hant_tw: 後備方案

source: Forward 10 Seconds
zh_hans: 快进 10 秒
zh_hant_hk: 快進 10 秒
zh_hant_tw: 快進 10 秒

source: Invalid URL
zh_hans: 无效的 URL
zh_hant_hk: 無效的 URL
zh_hant_tw: 無效的 URL

# Invalid URL: %@
source: Invalid URL: %1$@
zh_hans: 无效的 URL：%1$@
zh_hant_hk: 無效的 URL：%1$@
zh_hant_tw: 無效的 URL：%1$@

source: Light Mode
zh_hans: 浅色模式
zh_hant_hk: 淺色模式
zh_hant_tw: 淺色模式

source: Like Current Media
zh_hans: 喜欢当前媒体
zh_hant_hk: 喜歡當前媒體
zh_hant_tw: 喜歡當前媒體

source: Loading
zh_hans: 加载中
zh_hant_hk: 加載中
zh_hant_tw: 載入中

source: Loading State
zh_hans: 加载状态
zh_hant_hk: 加載狀態
zh_hant_tw: 載入狀態

source: Loading...
zh_hans: 加载中...
zh_hant_hk: 加載中...
zh_hant_tw: 載入中...

source: Network error
zh_hans: 网络错误
zh_hant_hk: 網絡錯誤
zh_hant_tw: 網路錯誤

# Network error: %@
source: Network error: %1$@
zh_hans: 网络错误：%1$@
zh_hant_hk: 網絡錯誤：%1$@
zh_hant_tw: 網路錯誤：%1$@

source: Next Track
zh_hans: 下一首曲目
zh_hant_hk: 下一首曲目
zh_hant_tw: 下一首曲目

source: No Artist
zh_hans: 无艺术家
zh_hant_hk: 無藝術家
zh_hant_tw: 無藝術家

source: No Artist Info
zh_hans: 无艺术家信息
zh_hant_hk: 無藝術家信息
zh_hant_tw: 無藝術家資訊

source: No Artwork
zh_hans: 无封面
zh_hant_hk: 無封面
zh_hant_tw: 無封面

source: No artwork available
zh_hans: 无专辑封面
zh_hant_hk: 無專輯封面
zh_hant_tw: 無專輯封面

source: No media loaded
zh_hans: 未加载媒体
zh_hant_hk: 未加載媒體
zh_hant_tw: 未載入媒體

source: No media selected
zh_hans: 未选择媒体
zh_hant_hk: 未選擇媒體
zh_hant_tw: 未選擇媒體

source: No Media Selected
zh_hans: 未选择媒体
zh_hant_hk: 未選擇媒體
zh_hant_tw: 未選擇媒體

source: No Subscribers
zh_hans: 无订阅者
zh_hant_hk: 無訂閲者
zh_hant_tw: 無訂閱者

source: No subscribers are currently registered.
zh_hans: 当前没有订阅者
zh_hant_hk: 當前沒有訂閲者
zh_hant_tw: 當前沒有訂閱者

source: No URL (Empty State)
zh_hans: 无 URL（空状态）
zh_hant_hk: 無 URL（空狀態）
zh_hant_tw: 無 URL（空狀態）

source: Now Playing
zh_hans: 正在播放
zh_hant_hk: 正在播放
zh_hant_tw: 正在播放

source: Open Media Library
zh_hans: 打开媒体库
zh_hant_hk: 打開媒體庫
zh_hant_tw: 開啟媒體庫

source: Pass custom artwork using the artwork parameter
zh_hans: 使用 artwork 参数传入自定义封面图
zh_hant_hk: 使用 artwork 參數傳入自定義封面圖
zh_hant_tw: 使用 artwork 引數傳入自定義封面圖

source: Pause
zh_hans: 暂停
zh_hant_hk: 暫停
zh_hant_tw: 暫停

source: Paused
zh_hans: 已暂停
zh_hant_hk: 已暫停
zh_hant_tw: 已暫停

source: Play
zh_hans: 播放
zh_hant_hk: 播放
zh_hant_tw: 播放

source: Playback error
zh_hans: 播放错误
zh_hant_hk: 播放錯誤
zh_hant_tw: 播放錯誤

# Playback error: %@
source: Playback error: %1$@
zh_hans: 播放错误：%1$@
zh_hant_hk: 播放錯誤：%1$@
zh_hant_tw: 播放錯誤：%1$@

source: Playing
zh_hans: 播放中
zh_hant_hk: 播放中
zh_hant_tw: 播放中

source: Please select a media file to play
zh_hans: 请选择一个媒体文件开始播放
zh_hant_hk: 請選擇一個媒體文件開始播放
zh_hant_tw: 請選擇一個媒體檔案開始播放

source: Preparing...
zh_hans: 准备中...
zh_hant_hk: 準備中...
zh_hant_tw: 準備中...

source: Previous Track
zh_hans: 上一首曲目
zh_hant_hk: 上一首曲目
zh_hant_tw: 上一首曲目

source: Priority
zh_hans: 优先级
zh_hant_hk: 優先級
zh_hant_tw: 優先順序

source: Priority: External > Local > Default
zh_hans: 优先级：外部 > 本地 > 默认
zh_hant_hk: 優先級：外部 > 本地 > 默認
zh_hant_tw: 優先順序：外部 > 本地 > 預設

source: Quiet
zh_hans: 静默
zh_hant_hk: 靜默
zh_hant_tw: 靜默

source: Ready
zh_hans: 就绪
zh_hant_hk: 就緒
zh_hant_tw: 就緒

source: Repeat All
zh_hans: 全部循环
zh_hant_hk: 全部循環
zh_hant_tw: 全部迴圈

source: Retry
zh_hans: 重试
zh_hant_hk: 重試
zh_hant_tw: 重試

source: Rewind 10 Seconds
zh_hans: 快退 10 秒
zh_hant_hk: 快退 10 秒
zh_hant_tw: 快退 10 秒

source: Select a media file from your library
zh_hans: 从媒体库中选择媒体文件
zh_hant_hk: 從媒體庫中選擇媒體文件
zh_hant_tw: 從媒體庫中選擇媒體檔案

source: Select a media file to play
zh_hans: 选择一个媒体文件开始播放
zh_hant_hk: 選擇一個媒體文件開始播放
zh_hant_tw: 選擇一個媒體檔案開始播放

source: Select Media
zh_hans: 选择媒体
zh_hant_hk: 選擇媒體
zh_hant_tw: 選擇媒體

source: Sequential Play
zh_hans: 顺序播放
zh_hant_hk: 順序播放
zh_hant_tw: 順序播放

source: Set default artwork using the defaultArtwork parameter
zh_hans: 使用 defaultArtwork 参数设置默认封面
zh_hant_hk: 使用 defaultArtwork 參數設置默認封面
zh_hant_tw: 使用 defaultArtwork 引數設定預設封面

source: Show Error Message and Retry Button
zh_hans: 显示错误信息和重试按钮
zh_hant_hk: 顯示錯誤信息和重試按鈕
zh_hant_tw: 顯示錯誤資訊和重試按鈕

source: Show Event Subscribers
zh_hans: 显示事件订阅者
zh_hant_hk: 顯示事件訂閲者
zh_hant_tw: 顯示事件訂閱者

source: Show Loading Indicator
zh_hans: 显示加载指示器
zh_hant_hk: 顯示加載指示器
zh_hant_tw: 顯示載入指示器

source: Shuffle Play
zh_hans: 随机播放
zh_hant_hk: 隨機播放
zh_hant_tw: 隨機播放

source: Since
zh_hans: 始于
zh_hant_hk: 始於
zh_hant_tw: 始於

source: Single Track Loop
zh_hans: 单曲循环
zh_hant_hk: 單曲循環
zh_hant_tw: 單曲迴圈

source: Stopped
zh_hans: 已停止
zh_hant_hk: 已停止
zh_hant_tw: 已停止

source: Supported Formats
zh_hans: 支持的格式
zh_hant_hk: 支持的格式
zh_hant_tw: 支援的格式

source: The file format is not supported or the file is corrupted
zh_hans: 不支持该文件格式或文件已损坏
zh_hant_hk: 不支持該文件格式或文件已損壞
zh_hant_tw: 不支援該檔案格式或檔案已損壞

source: The media file is invalid or corrupted
zh_hans: 媒体文件无效或已损坏
zh_hant_hk: 媒體文件無效或已損壞
zh_hant_tw: 媒體檔案無效或已損壞

source: The provided URL is invalid
zh_hans: 提供的 URL 无效
zh_hant_hk: 提供的 URL 無效
zh_hant_tw: 提供的 URL 無效

source: The selected media type is not supported
zh_hans: 不支持所选媒体类型
zh_hant_hk: 不支持所選媒體類型
zh_hant_tw: 不支援所選媒體型別

source: There was a problem during playback
zh_hans: 播放过程中出现问题
zh_hant_hk: 播放過程中出現問題
zh_hant_tw: 播放過程中出現問題

source: There was a problem with the network connection
zh_hans: 网络连接出现问题
zh_hant_hk: 網絡連接出現問題
zh_hant_tw: 網路連線出現問題

source: This is the first track
zh_hans: 这是第一首曲目
zh_hant_hk: 這是第一首曲目
zh_hant_tw: 這是第一首曲目

source: This is the last track
zh_hans: 这是最后一首曲目
zh_hant_hk: 這是最後一首曲目
zh_hant_tw: 這是最後一首曲目

source: Try Again
zh_hans: 再试一次
zh_hant_hk: 再試一次
zh_hant_tw: 再試一次

source: Try reloading the media file
zh_hans: 尝试重新加载媒体文件
zh_hant_hk: 嘗試重新加載媒體文件
zh_hant_tw: 嘗試重新載入媒體檔案

source: Try with a different media file
zh_hans: 尝试使用其他媒体文件
zh_hant_hk: 嘗試使用其他媒體文件
zh_hant_tw: 嘗試使用其他媒體檔案

source: Unlike Current Media
zh_hans: 取消喜欢当前媒体
zh_hant_hk: 取消喜歡當前媒體
zh_hant_tw: 取消喜歡當前媒體

source: Unsupported format
zh_hans: 不支持的格式
zh_hant_hk: 不支持的格式
zh_hant_tw: 不支援的格式

# Unsupported format: %@
source: Unsupported format: %1$@
zh_hans: 不支持的格式：%1$@
zh_hant_hk: 不支持的格式：%1$@
zh_hant_tw: 不支援的格式：%1$@

source: URL parameter is nil
zh_hans: url 参数为 nil
zh_hant_hk: url 參數為 nil
zh_hant_tw: url 引數為 nil

source: Use the default cover as a fallback
zh_hans: 使用默认封面作为后备方案
zh_hant_hk: 使用默認封面作為後備方案
zh_hant_tw: 使用預設封面作為後備方案

source: Use the defaultArtwork parameter
zh_hans: 使用 defaultArtwork 参数
zh_hant_hk: 使用 defaultArtwork 參數
zh_hant_tw: 使用 defaultArtwork 引數

source: Verbose
zh_hans: 详细
zh_hant_hk: 詳細
zh_hant_tw: 詳細

source: Will Play
zh_hans: 即将播放
zh_hant_hk: 即將播放
zh_hant_tw: 即將播放

source: With Default Cover
zh_hans: 带默认封面
zh_hant_hk: 帶默認封面
zh_hant_tw: 帶預設封面
